m5stack/M5AtomS3/src/utility/In_eSPI_ESP32_S3.h
#ifdef USE_HSPI_PORT

#ifndef TFT_MISO
#define TFT_MISO -1
#endif

#ifndef TFT_MOSI
#define TFT_MOSI 13
#endif
#if (TFT_MOSI == -1)
#undef TFT_MOSI
#define TFT_MOSI 13
#endif

#ifndef TFT_SCLK
#define TFT_SCLK 14
#endif
#if (TFT_SCLK == -1)
#undef TFT_SCLK
#define TFT_SCLK 14
#endif

#else  // VSPI port

#ifndef TFT_MISO
#define TFT_MISO -1
#endif

#ifndef TFT_MOSI
#define TFT_MOSI 23
#endif
#if (TFT_MOSI == -1)
#undef TFT_MOSI
#define TFT_MOSI 23
#endif

#ifndef TFT_SCLK
#define TFT_SCLK 18
#endif
#if (TFT_SCLK == -1)
#undef TFT_SCLK
#define TFT_SCLK 18
#endif

#if defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32S2)
#if (TFT_MISO == -1)
#undef TFT_MISO
#define TFT_MISO TFT_MOSI
#endif
#endif

#endif

#endif

////////////////////////////////////////////////////////////////////////////////////////
// Define the parallel bus interface chip pin drive code
////////////////////////////////////////////////////////////////////////////////////////
#if defined(TFT_PARALLEL_8_BIT)

// Create a bit set lookup table for data bus - wastes 1kbyte of RAM but speeds
// things up dramatically can then use e.g. GPIO.out_w1ts = set_mask(0xFF); to
// set data bus to 0xFF
#define PARALLEL_INIT_TFT_DATA_BUS                   \
    for (int32_t c = 0; c < 256; c++) {              \
        xset_mask[c] = 0;                            \
        if (c & 0x01) xset_mask[c] |= (1 << TFT_D0); \
        if (c & 0x02) xset_mask[c] |= (1 << TFT_D1); \
        if (c & 0x04) xset_mask[c] |= (1 << TFT_D2); \
        if (c & 0x08) xset_mask[c] |= (1 << TFT_D3); \
        if (c & 0x10) xset_mask[c] |= (1 << TFT_D4); \
        if (c & 0x20) xset_mask[c] |= (1 << TFT_D5); \
        if (c & 0x40) xset_mask[c] |= (1 << TFT_D6); \
        if (c & 0x80) xset_mask[c] |= (1 << TFT_D7); \
    }

// Mask for the 8 data bits to set pin directions
#define GPIO_DIR_MASK                                                \
    ((1 << TFT_D0) | (1 << TFT_D1) | (1 << TFT_D2) | (1 << TFT_D3) | \
     (1 << TFT_D4) | (1 << TFT_D5) | (1 << TFT_D6) | (1 << TFT_D7))

#if (TFT_WR >= 32)
// Data bits and the write line are cleared sequentially
#define GPIO_OUT_CLR_MASK \
    (GPIO_DIR_MASK);      \
    WR_L
#elif (TFT_WR >= 0)
// Data bits and the write line are cleared to 0 in one step (1.25x faster)
#define GPIO_OUT_CLR_MASK (GPIO_DIR_MASK | (1 << TFT_WR))
#else
#define GPIO_OUT_CLR_MASK
#endif

// A lookup table is used to set the different bit patterns, this uses 1kByte of
// RAM
#define set_mask(C) \
    xset_mask[C]  // 63fps Sprite rendering test 33% faster, graphicstest
                  // only 1.8% faster than shifting in real time

// Real-time shifting alternative to above to save 1KByte RAM, 47 fps Sprite
// rendering test
/*#define set_mask(C) (((C)&0x80)>>7)<<TFT_D7 | (((C)&0x40)>>6)<<TFT_D6 |
(((C)&0x20)>>5)<<TFT_D5 | (((C)&0x10)>>4)<<TFT_D4 | \
                      (((C)&0x08)>>3)<<TFT_D3 | (((C)&0x04)>>2)<<TFT_D2 |
(((C)&0x02)>>1)<<TFT_D1 | (((C)&0x01)>>0)<<TFT_D0
//*/

// Write 8 bits to TFT
#define tft_Write_8(C)                      \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;      \
    GPIO.out_w1ts = set_mask((uint8_t)(C)); \
    WR_H

#if defined(SSD1963_DRIVER)

// Write 18 bit color to TFT
#define tft_Write_16(C)                                     \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;                      \
    GPIO.out_w1ts = set_mask((uint8_t)(((C)&0xF800) >> 8)); \
    WR_H;                                                   \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;                      \
    GPIO.out_w1ts = set_mask((uint8_t)(((C)&0x07E0) >> 3)); \
    WR_H;                                                   \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;                      \
    GPIO.out_w1ts = set_mask((uint8_t)(((C)&0x001F) << 3)); \
    WR_H

// 18 bit color write with swapped bytes
#define tft_Write_16S(C)           \
    Cswap = ((C) >> 8 | (C) << 8); \
    tft_Write_16(Cswap)

#else

#ifdef PSEUDO_16_BIT
// One write strobe for both bytes
#define tft_Write_16(C)                            \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H
#define tft_Write_16S(C)                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H
#else
// Write 16 bits to TFT
#define tft_Write_16(C)                            \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H

// 16 bit write with swapped bytes
#define tft_Write_16S(C)                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H
#endif

#endif

// Write 32 bits to TFT
#define tft_Write_32(C)                             \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;              \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 24)); \
    WR_H;                                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;              \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 16)); \
    WR_H;                                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;              \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8));  \
    WR_H;                                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;              \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0));  \
    WR_H

// Write two concatenated 16 bit values to TFT
#define tft_Write_32C(C, D)                        \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((D) >> 8)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((D) >> 0)); \
    WR_H

