m5stack/M5AtomS3/src/utility/In_eSPI_ESP32_S3.h
// Write 16 bit value twice to TFT - used by drawPixel()
#define tft_Write_32D(C)                           \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 8)); \
    WR_H;                                          \
    GPIO.out_w1tc = GPIO_OUT_CLR_MASK;             \
    GPIO.out_w1ts = set_mask((uint8_t)((C) >> 0)); \
    WR_H

// Read pin
#ifdef TFT_RD
#if (TFT_RD >= 32)
#define RD_L GPIO.out1_w1tc.val = (1 << (TFT_RD - 32))
#define RD_H GPIO.out1_w1ts.val = (1 << (TFT_RD - 32))
#elif (TFT_RD >= 0)
#define RD_L GPIO.out_w1tc = (1 << TFT_RD)
//#define RD_L digitalWrite(TFT_WR, LOW)
#define RD_H GPIO.out_w1ts = (1 << TFT_RD)
//#define RD_H digitalWrite(TFT_WR, HIGH)
#else
#define RD_L
#define RD_H
#endif
#else
#define TFT_RD -1
#define RD_L
#define RD_H
#endif

////////////////////////////////////////////////////////////////////////////////////////
// Macros to write commands/pixel colour data to a SPI ILI948x TFT
////////////////////////////////////////////////////////////////////////////////////////
#elif defined(SPI_18BIT_DRIVER)  // SPI 18 bit colour

// Write 8 bits to TFT
#define tft_Write_8(C) spi.transfer(C)

// Convert 16 bit colour to 18 bit and write in 3 bytes
#define tft_Write_16(C)              \
    spi.transfer(((C)&0xF800) >> 8); \
    spi.transfer(((C)&0x07E0) >> 3); \
    spi.transfer(((C)&0x001F) << 3)

// Future option for transfer without wait
#define tft_Write_16N(C) tft_Write_16(C)

// Convert swapped byte 16 bit colour to 18 bit and write in 3 bytes
#define tft_Write_16S(C)                                \
    spi.transfer((C)&0xF8);                             \
    spi.transfer(((C)&0xE000) >> 11 | ((C)&0x07) << 5); \
    spi.transfer(((C)&0x1F00) >> 5)

// Write 32 bits to TFT
#define tft_Write_32(C)     spi.write32(C)

// Write two concatenated 16 bit values to TFT
#define tft_Write_32C(C, D) spi.write32((C) << 16 | (D))

// Write 16 bit value twice to TFT
#define tft_Write_32D(C)    spi.write32((C) << 16 | (C))

////////////////////////////////////////////////////////////////////////////////////////
// Macros to write commands/pixel colour data to an Raspberry Pi TFT
////////////////////////////////////////////////////////////////////////////////////////
#elif defined(RPI_DISPLAY_TYPE)

// ESP32 low level SPI writes for 8, 16 and 32 bit values
// to avoid the function call overhead
#define TFT_WRITE_BITS(D, B)                               \
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), B - 1);    \
    WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), D);               \
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);     \
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR) \
        ;

// Write 8 bits
#define tft_Write_8(C)   TFT_WRITE_BITS((C) << 8, 16)

// Write 16 bits with corrected endianness for 16 bit colours
#define tft_Write_16(C)  TFT_WRITE_BITS((C) << 8 | (C) >> 8, 16)

// Future option for transfer without wait
#define tft_Write_16N(C) tft_Write_16(C)

// Write 16 bits
#define tft_Write_16S(C) TFT_WRITE_BITS(C, 16)

// Write 32 bits
#define tft_Write_32(C)  TFT_WRITE_BITS(C, 32)

// Write two address coordinates
#define tft_Write_32C(C, D)              \
    TFT_WRITE_BITS((C) << 24 | (C), 32); \
    TFT_WRITE_BITS((D) << 24 | (D), 32)

// Write same value twice
#define tft_Write_32D(C) tft_Write_32C(C, C)

////////////////////////////////////////////////////////////////////////////////////////
// Macros for all other SPI displays
////////////////////////////////////////////////////////////////////////////////////////
#else
/* Old macros
  // ESP32 low level SPI writes for 8, 16 and 32 bit values
  // to avoid the function call overhead
  #define TFT_WRITE_BITS(D, B) \
  WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), B-1); \
  WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), D); \
  SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR); \
  while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);

  // Write 8 bits
  #define tft_Write_8(C) TFT_WRITE_BITS(C, 8)

  // Write 16 bits with corrected endianness for 16 bit colours
  #define tft_Write_16(C) TFT_WRITE_BITS((C)<<8 | (C)>>8, 16)

  // Write 16 bits
  #define tft_Write_16S(C) TFT_WRITE_BITS(C, 16)

  // Write 32 bits
  #define tft_Write_32(C) TFT_WRITE_BITS(C, 32)

  // Write two address coordinates
  #define tft_Write_32C(C,D) TFT_WRITE_BITS((uint16_t)((D)<<8 | (D)>>8)<<16 |
(uint16_t)((C)<<8 | (C)>>8), 32)

  // Write same value twice
  #define tft_Write_32D(C) TFT_WRITE_BITS((uint16_t)((C)<<8 | (C)>>8)<<16 |
(uint16_t)((C)<<8 | (C)>>8), 32)
//*/
//* Replacement slimmer macros
#if !defined(CONFIG_IDF_TARGET_ESP32S3)
#define TFT_WRITE_BITS(D, B)    \
    *_spi_mosi_dlen = B - 1;    \
    *_spi_w         = D;        \
    *_spi_cmd       = SPI_USR;  \
    while (*_spi_cmd & SPI_USR) \
        ;
#else
#define TFT_WRITE_BITS(D, B)       \
    *_spi_mosi_dlen = B - 1;       \
    *_spi_w         = D;           \
    *_spi_cmd       = SPI_UPDATE;  \
    while (*_spi_cmd & SPI_UPDATE) \
        ;                          \
    *_spi_cmd = SPI_USR;           \
    while (*_spi_cmd & SPI_USR)    \
        ;
#endif
// Write 8 bits
#define tft_Write_8(C)  TFT_WRITE_BITS(C, 8)

// Write 16 bits with corrected endianness for 16 bit colours
#define tft_Write_16(C) TFT_WRITE_BITS((C) << 8 | (C) >> 8, 16)

// Future option for transfer without wait
#if !defined(CONFIG_IDF_TARGET_ESP32S3)
#define tft_Write_16N(C)                     \
    *_spi_mosi_dlen = 16 - 1;                \
    *_spi_w         = ((C) << 8 | (C) >> 8); \
    *_spi_cmd       = SPI_USR;
#else
#define tft_Write_16N(C)                     \
    *_spi_mosi_dlen = 16 - 1;                \
    *_spi_w         = ((C) << 8 | (C) >> 8); \
    *_spi_cmd       = SPI_UPDATE;            \
    while (*_spi_cmd & SPI_UPDATE)           \
        ;                                    \
    *_spi_cmd = SPI_USR;
#endif

// Write 16 bits
#define tft_Write_16S(C) TFT_WRITE_BITS(C, 16)

// Write 32 bits
#define tft_Write_32(C)  TFT_WRITE_BITS(C, 32)

// Write two address coordinates
#define tft_Write_32C(C, D)                                \
    TFT_WRITE_BITS((uint16_t)((D) << 8 | (D) >> 8) << 16 | \
                       (uint16_t)((C) << 8 | (C) >> 8),    \
                   32)

// Write same value twice
#define tft_Write_32D(C)                                   \
    TFT_WRITE_BITS((uint16_t)((C) << 8 | (C) >> 8) << 16 | \
                       (uint16_t)((C) << 8 | (C) >> 8),    \
                   32)

//*/
#endif

#ifndef tft_Write_16N
#define tft_Write_16N tft_Write_16
#endif

////////////////////////////////////////////////////////////////////////////////////////
// Macros to read from display using SPI or software SPI
////////////////////////////////////////////////////////////////////////////////////////
#if !defined(TFT_PARALLEL_8_BIT)
// Read from display using SPI or software SPI
// Use a SPI read transfer
#define tft_Read_8() spi.transfer(0)
#endif

// Concatenate a byte sequence A,B,C,D to CDAB, P is a uint8_t pointer
#define DAT8TO32(P) ((uint32_t)P[0] << 8 | P[1] | P[2] << 24 | P[3] << 16)

#endif  // Header end
